# SingleElementEndIndex Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralConnectionHandler..::..SingleElementEndIndex Property
StructuralConnectionHandler Class See Also
---
Element end index for single element connections (0: start, 1: end).
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public int SingleElementEndIndex { get; set; }
```

Visual Basic
---
```text
Public Property SingleElementEndIndex As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int SingleElementEndIndex {
	int get ();
	void set (int value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: singleElementEndIndex is not a valid end index. |

# See Also
StructuralConnectionHandler Class
Autodesk.Revit.DB.Structure Namespace